In [8]:
import pandas as pd
import numpy as np

In [9]:
df1 = pd.DataFrame([[1, 2, 3, 0],
                   [3, 4, 6, 1],
                   [2, 1, 2, 5],
                   [1, 3, 5, 4]],
                   columns=list('ABCD'))

df2 = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, 2, 5],
                   [1, 3, np.nan, 4]],
                   columns=list('ABCD'))

In [10]:
df1

   A  B  C  D
0  1  2  3  0
1  3  4  6  1
2  2  1  2  5
3  1  3  5  4

In [11]:
df2

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  NaN  NaN  2.0  5
3  1.0  3.0  NaN  4

In [13]:
df1.mean()

A    1.75
B    2.50
C    4.00
D    2.50
dtype: float64

In [15]:
df2.mean()

A    2.0
B    3.0
C    2.0
D    2.5
dtype: float64

In [16]:
df2.fillna(df2.mean())

     A    B    C  D
0  2.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  2.0  3.0  2.0  5
3  1.0  3.0  2.0  4